Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འདོད་པ་ནི་རྣམ་པ་གསུམ་དུ་འཇུག་སྟེ། ཐེག་པ་གསུམ་བསྒོམ་པར་འདོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆེ་བའི་བདག་ཉིད་འདོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཆེ་བའི་བདག་ཉིད་འདོད་པའོ།
en: The wanting of bodhisattvas refers to three things: they want to make themselves familiar with the three vehicles, they want the greatnesses of bodhisattvas, andthey want the greatnesses of buddhas.

source: །དེ་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པས་ཞེས་བྱ་བ་ནས་ཐམས་ཅད་ཤེས་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་འདོད་པ་ཞེས་བྱ་བའི་བར་གྱི་ཚིག་ལྔས་ཐེག་པ་གསུམ་འབྲས་བུ་དང་བཅས་པ་བསྟན་ཏོ། །བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་པར་འདོད་པས་ཞེས་བྱ་བ་ནས།
en: The five parts of the statement, from “who want to fully awaken to the knowledge, furnished with the best of all aspects, of a knower of all,” up to “who want to perfect all-knowledge,” teach the three vehicles and the result.

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་སངས་རྒྱས་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་དགོད་པར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ་ཞེས་བྱ་བའི་བར་གྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆེ་བའི་བདག་ཉིད་བསྟན་ཏོ།
en: From “who want to enter into the secure state of a bodhisattva,” up to “bodhisattva great beings who want to establish them in the result of stream enterer, the result of once-returner, the result of non-returner, the state of a worthy one, in a pratyekabuddha’s awakening, and in unsurpassed, perfect awakening should train in the perfection of wisdom,” teaches the greatnesses of bodhisattvas.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ལམ་ལ་སློབ་པར་འདོད་པ་ཞེས་བྱ་བ་ནས་འདོད་པའི་ཡོན་ཏན་ལྔ་ཉེ་བར་ལེན་པའི་བར་གྱིས་ནི་སངས་རྒྱས་ཀྱི་ཆེ་བའི་བདག་ཉིད་བསྟན་ཏོ།
en: Then, from “who want to train in the tathāgatas’ way of carrying themselves,” up to “make use of those five sorts of sense objects,” teaches the greatnesses of buddhas.

source: །དེ་ལ་ཡེ་ཤེས་གསུམ་ཞེས་བྱ་བ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། ཐམས་ཅད་ཤེས་པ་ཉིད་དོ།
en: They want to make themselves familiar with the three vehicles In regard to those [five], the “three knowledges” are the knowledge of all aspects, the knowledge of path aspects, and all-knowledge.

source: །དེ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་གནས་ཤིན་ཏུ་གྱུར་པས་རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱིས་བསྡུས་པ་འཇིག་རྟེན་ལས་འདས་པ་རྣམ་པར་མི་རྟོག་པའི་ཡེ་ཤེས་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱའོ།
en: Among them, the extraordinary, nonconceptual knowledge included in the vajra-like meditative stabilization when there is a lord buddha’s transformation of the basis is called “the knowledge of all aspects.”

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསྒྲུབ་པའི་སར་གཏོགས་པ་ས་བཅུའི་རིམ་པས་ངེས་པར་བྱུང་བ། ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་བདག་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཅེས་བྱའོ།
en: Knowledge in the form of the bodhisattva’s path—the practice of the perfections and so on—that emerges in a series of ten levels, bringing the bodhisattvas to accomplishment, is called “the knowledge of path aspects.”

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་འདུ་བྱེད་ཐམས་ཅད་ནི་མི་རྟག་པའོ། །ཟག་པ་དང་བཅས་པ་ཐམས་ཅད་ནི་སྡུག་བསྔལ་བའོ། །ཆོས་ཐམས་ཅད་ནི་བདག་མེད་པའོ་ཞེས་བྱ་བ་ཐམས་ཅད་མི་རྟག་པ་ལ་སོགས་པའི་རྣམ་པར་འཇུག་པ་བསྒོམ་པའི་རྒྱུ་ལས་བྱུང་བ། འཇིག་རྟེན་ལས་འདས་པའི་ལམ་གྱི་ཡེ་ཤེས་ལ་ཐམས་ཅད་ཤེས་པ་ཉིད་ཅེས་བྱའོ།
en: The extraordinary path knowledge of śrāvakas and pratyekabuddhas that is caused by meditating on “everything compounded is impermanent,” “everything with outflows is suffering,” and “every dharma is selfless,” engaged with the aspects of impermanence and so on, is called “all-knowledge.”

source: །དེ་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པ་ཞེས་བྱ་བས་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པ་བསྟན་ཏོ། །བག་ཆགས་དང་། མཚམས་སྦྱོར་བ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པར་འདོད་པས་ཞེས་བྱ་བས་ནི་དེའི་འབྲས་བུ་བསྟན་ཏོ།
en: The statement “who want to fully awaken to the knowledge, furnished with the best of all aspects, of a knower of all” teaches that they want to fully awaken to the knowledge of all aspects; “want to destroy all residual impressions, connections, and afflictions” teaches its result.

source: །ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པས་ཞེས་བྱ་བ་དེ་ཉིད་ཀྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བསྟན་ཟིན་ན་ཡང་འདིར་ཅིའི་ཕྱིར་བསྟན་ཞེ་ན།
en: Qualm: But just that “want to fully awaken to all dharmas in all forms” has already taught the knowledge of all aspects, so why is it teaching it again?

source: འདི་ལ་ཉེས་པ་མེད་དེ་སྔར་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པས་ཞེས་བྱ་བ་སྨོས་པས་ནི་ཆོས་ཐམས་ཅད་རྟོགས་པར་བྱ་བ་བསྟན་གྱི། འདིར་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཉིད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པས་ཞེས་བྱ་བས་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཉིད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བསྟན་ཏོ།
en: There is no fault, because the earlier “want to fully awaken to all dharmas” was teaching all the dharmas that have to be realized, but here, with “want to fully awaken to the knowledge of a knower of all,” it is teaching the full awakening to just that knowledge of a knower of all.

source: །འོ་ན་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་ཞེས་བྱ་བའི་བྱེ་བྲག་བརྗོད་པ་ཅི་དགོས་ཤེ་ན།
en: Qualm: What is its purpose in qualifying it with “furnished with the best of all aspects”?

source: འདི་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ནི་རྣམ་པ་གསུམ་སྟེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། སངས་རྒྱས་རྣམས་ཀྱི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཆོས་ཐམས་ཅད་ལ་དམིགས་པ་དང་།
en: There, the knowledge of a knower of all is threefold: the all-knowledge of śrāvakas and pratyekabuddhas, and the all-knowing knowledge of buddhas with all dharmas as its objective support.

source: སངས་རྒྱས་རྣམས་ཀྱི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྣམ་པར་མི་རྟོག་པ་ལ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཞེས་བྱ་སྟེ།
en: The nonconceptual all-knowing knowledge of buddhas is also called “the knowledge of a knower of all.”

source: དེ་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པས་ཞེས་བྱ་བ་དེ་ཙམ་ཞིག་བསྟན་ན་ཡེ་ཤེས་གང་ལ་བྱ་སྙམ་ནས་ཐེ་ཚོམ་ཟ་བར་འགྱུར་རོ།
en: Were it just to have said “wants to fully awaken to the knowledge of a knower of all,” there would have been uncertainty about which knowledge it is referring to.

source: །དེ་བས་ན་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་ཞེས་བྱ་བའི་བྱེ་བྲག་སྨོས་ཏེ།
en: Hence, it qualifies it with “furnished with the best of all aspects.”

source: དེས་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཞེས་བྱ་བར་བསྟན་པ་ཡིན་ནོ།
en: With that it teaches the “knowledge of a knower of all aspects.”

source: །དེ་ལ་རྣམ་པ་ཐམས་ཅད་ནི་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། གཟོད་མ་ནས་ཞི་བ་དང་། རང་བཞིན་གྱིས་མྱ་ངན་ལས་འདས་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་།
en: As for all the aspects, they are the nonarising unproduced aspect, the unceasing, the primordially calm, the naturally in nirvāṇa, the nonexistence of an intrinsic nature, emptiness, signlessness, wishlessness, and so on.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལ་སོགས་པ་སྟེ། རྣམ་པ་དེ་དག་ཐམས་ཅད་ཀྱི་རྣམ་པའི་མཆོག་ནི་རྣམ་པའི་གཙོ་བོ་སྟོང་པ་ཉིད་ཀྱི་རྣམ་པ་སྟེ། དེ་ནི་རྣམ་པ་གཞན་དག་གི་རྩ་བར་གྱུར་པའི་ཕྱིར་རོ།
en: The best of all of those aspects, the principal one, is the emptiness aspect because it is the root of the other aspects.

source: །དེ་བས་ན་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་གི་རྣམ་པ་དང་ལྡན་པ། རྣམ་པར་མི་རྟོག་པ་དམིགས་པར་བྱ་བ་དང་། དམིགས་པར་བྱེད་པའི་དངོས་པོ་མཉམ་པས་མཉམ་པ་ཉིད་དུ་འཇུག་པ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཡིན་པར་བསྟན་ཏོ།
en: Therefore, it is taught that the entry into the sameness where the entities of apprehended and apprehender are the same, furnished with the best of all aspects and without conceptualization, is the knowledge of a knower of all aspects.

source: །ཡང་ན་འདིས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཉིད་བསྟན་ཏེ།
en: Alternatively, the knowledge of a knower of all itself is being taught.

source: རྣམ་པ་ཐམས་ཅད་ནི་དགེ་བ་དང་། མི་དགེ་བ་ལུང་དུ་མ་བསྟན་པའི་ཚོགས་སུ་གཏོགས་པ་དང་། ཡང་དག་པ་ཉིད་དུ་ངེས་པ་དང་། ལོག་པ་ཉིད་དུ་ངེས་པ་དང་། མ་ངེས་པའི་ཚོགས་སུ་གཏོགས་པའི་རྣམ་པ་དག་སྟེ།
en: All the aspects are then those aspects included in the collection of the wholesome, unwholesome, and neutral, as well as those included in the collection of those destined for what is right, destined for error, and those of uncertain destiny.

source: དེ་ལྟར་སངས་རྒྱས་རྣམས་ཀྱི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ནི་མི་དགེ་བ་དང་ལུང་དུ་མ་བསྟན་པ་དང་། ཡང་དག་པ་ཉིད་དུ་ངེས་པ་དང་ལོག་པ་ཉིད་དུ་ངེས་པ་དང་། མ་ངེས་པའི་ཚོགས་སུ་གཏོགས་པ་རྣམས་ཐུགས་སུ་ཆུད་པས་ན། རྣམ་པ་ཐམས་ཅད་དང་ལྡན་པར་འགྱུར་རོ།
en: In this case, a buddha’s knowledge of a knower of all is furnished with all aspects because it comprehends what is included in the collections of the unwholesome and neutral, as well as those destined for error and those of uncertain destiny.

source: །དགེ་བ་དང་ཡང་དག་པ་ཉིད་དུ་ངེས་པའི་ཚོགས་སུ་གཏོགས་པ་རྣམས་ཐུགས་སུ་ཆུད་པས་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་གི་རྣམ་པ་དང་ལྡན་པར་འགྱུར་རོ་ཞེས་ཀྱང་བཤད་དོ།
en: It is said to be “furnished with the best of all aspects” because it comprehends what is included in the collections of the wholesome and those destined for what is right.

source: །དེ་ལྟ་བུ་མངོན་པར་བྱང་ཆུབ་པར་འདོད་པ་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་མངོན་པར་བྱང་ཆུབ་པར་འདོད་པ་ཞེས་བྱ་བ་གསུངས་པའོ། །བག་ཆགས་དང་། མཚམས་སྦྱོར་བ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པར་འདོད་པ་ཞེས་བྱ་བས་ནི་དེའི་འབྲས་བུ་བསྟན་ཏེ། ལས་ཀྱི་བག་ཆགས་དང་། ཉོན་མོངས་པའི་བག་ཆགས་དང་།
en: Those who want such an awakening are said to “want to fully awaken to the knowledge, furnished with the best of all aspects, of a knower of all”; “want to destroy all residual impressions, connections, and afflictions” teaches its result.

source: སྐྱེ་བའི་བག་ཆགས་ནི་བག་ཆགས་རྣམ་པ་གསུམ་མོ། །ལས་ཀྱི་མཚམས་སྦྱོར་བ་དང་། ཉོན་མོངས་པའི་མཚམས་སྦྱོར་བ་དང་། སྐྱེ་བའི་མཚམས་སྦྱོར་བ་ནི་མཚམས་སྦྱོར་བ་གསུམ་མོ། །རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་མཚམས་སྦྱོར་བ་གསུམ་ཡིན་པའི་ཕྱིར།
en: Residual impressions of action, residual impressions of affliction, and residual impressions of birth are the three sorts of residual impressions; connections of action, connections of affliction, and connections of birth are the three sorts of connections, because the connections of dependent origination are three.

source: བག་ཆགས་ཐམས་ཅད་དང་། མཚམས་སྦྱོར་བ་ཐམས་ཅད་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པར་འདོད་པས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: The meaning is that they “want to destroy” all “residual impressions,” all “connections, and all “afflictions.”

source: །དེའི་འོག་ཏུ་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་འདོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པའི་རྣམ་པ་ཤེས་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་འདོད་པས་ཞེས་བྱ་བ་གཉིས་ཀྱིས་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་འབྲས་བུ་དང་བཅས་པ་བསྟན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅིང་སེམས་ཅན་རྣམས་ཀྱི་སེམས་དང་སྤྱོད་པ་རྣམས་རྟོགས་པས་སེམས་ཅན་ལ་ཕན་པ་དག་སྒྲུབ་པོ།
en: Then the two— “want to perfect the knowledge of path aspects” and “want to perfect the knowledge of the aspects of the thought activity of all beings”— teach the knowledge of path aspects and its result, because bodhisattvas perfect the knowledge of the aspects of the paths and realize the thought and activity of beings, whereby they accomplish the welfare of beings.

source: །དེའི་འོག་ཏུ་ཐམས་ཅད་ཤེས་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་འདོད་པས་ཞེས་བྱ་བ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་ཡེ་ཤེས་བསྟན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཤེས་པ་ཉིད་མངོན་སུམ་མི་མཛད་དུ་ཟིན་ཀྱང་སེམས་ཅན་གྱི་དོན་དུ་ཐམས་ཅད་ཤེས་པ་ཉིད་ཀྱི་རང་བཞིན་དང་། ཐམས་ཅད་ཤེས་པ་ཉིད་ཐོབ་པར་བྱེད་པའི་རྒྱུ་མཁྱེན་ནས་སེམས་ཅན་རྣམས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་སོགས་པ་ལ་སོ་སོར་འགོད་དེ།
en: Then, “[they] want to perfect all-knowledge” teaches the knowledge of śrāvakas and pratyekabuddhas, because, even though bodhisattvas have not actualized all-knowledge, for the sake of beings they know the nature of all-knowledge and the causes for attaining all-knowledge, and they establish beings in their respective results of stream enterer and so on.

source: དེ་བས་ན་ཐམས་ཅད་ཤེས་པ་ཉིད་ཀྱང་དེས་ཡོངས་སུ་རྫོགས་པར་བྱས་པར་འགྱུར་རོ།
en: With that, therefore, they will have perfected all-knowledge.

source: །ཐམས་ཅད་ཤེས་པ་ཉིད་ཀྱི་གྲོགས་བྱེད་པའི་རྐྱེན་མ་བསྟན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཙམ་གྱིས་རྟོགས་པར་འགྱུར་བས་དགོས་པ་མེད་པའི་ཕྱིར་རོ།། །།བམ་པོ་ལྔ་པ།
en: The conditions that aid all-knowledge are not taught because bodhisattvas will know what they are from just this, so it is unnecessary.

source: དེའི་འོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པར་འདོད་པས་ཞེས་བྱ་བ་ལ་སོགས་པས་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་གྱི་ཆེ་བའི་བདག་ཉིད་འདོད་པ་བསྟན་ཏོ།
en: They want the greatnesses of bodhisattvas Then, “want to enter into the secure state of a bodhisattva” and so on teaches the desire for the greatnesses of bodhisattvas.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཡང་རྣམ་པ་བཞིར་བསྟན་ཏེ། མ་དག་པའི་སའི་ཡོན་ཏན་དང་། དག་པའི་སའི་ཡོན་ཏན་དང་། སོ་སོ་ཡང་དག་པར་རིག་པའི་སའི་ཡོན་ཏན་དང་། མཐར་ཐུག་པ་ལ་གནས་པའི་སའི་ཡོན་ཏན་རྣམས་སོ།
en: Furthermore, it teaches four qualities of bodhisattvas: qualities of the impure levels, qualities of the pure levels, qualities of the level of detailed and thorough knowledge, and qualities when standing on the final level.

source: །ས་དང་པོ་ནས་ས་བདུན་གྱི་བར་དུ་ནི་ཡིད་ལ་བྱེད་པ་རྩོལ་བ་དང་བཅས་པའི་ཕྱིར་མ་དག་པའི་ས་རྣམས་ཏེ།
en: From the first to the seventh level are the impure levels because bodhisattvas make an active effort to pay attention there.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པར་འདོད་པ་ཞེས་བྱ་བ་ནས། སངས་རྒྱས་ཀྱི་སྐུ་མངོན་པར་བསྒྲུབ་པར་འདོད་པ་ཞེས་བྱ་བའི་བར་དུ་ནི་དེ་དག་གི་ཡོན་ཏན་ཡིན་པར་ཤེས་པར་བྱའོ།
en: There you should know their qualities are from “want to enter into the secure state of a bodhisattva” up to “want to thoroughly establish a buddha’s body.”

source: །སངས་རྒྱས་ཀྱི་སྐུ་མངོན་པར་བསྒྲུབ་པ་ཞེས་བྱ་བ་ནས་དེ་བཞིན་ཉིད་ཁོང་དུ་ཆུད་པ་ཞེས་བྱ་བའི་བར་དུ་ནི་ས་བརྒྱད་པ་ལ་སའི་ཡོན་ཏན་དག་པ་རྣམས་སོ།
en: The qualities of the eighth level are from “want to thoroughly establish a buddha’s body” up to “comprehend the suchness of all dharmas.”

source: །རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་ཞེས་བྱ་བ་ནས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པའི་བར་དུ་ནི་ས་དགུ་པ་ལ་སོ་སོ་ཡང་དག་པར་རིག་པའི་སའི་ཡོན་ཏན་རྣམས་སོ། །འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་རྣམས་རྗེས་སུ་ཐོབ་པར་འདོད་པས་ཞེས་བྱ་བ་ནས་རྒྱུན་དུ་ཞུགས་པ་ལ་སོགས་པའི་འབྲས་བུ་ལ་སོ་སོར་འགོད་པའི་བར་དུ་ནི་ས་བཅུ་པ་ལ་མཐར་ཐུག་པར་གནས་པའི་ཡོན་ཏན་རྣམས་སོ།
en: The qualities of the level of detailed and thorough knowledge, on the ninth level, are from “tiny particles” up to the perfecting of the six perfections, and the qualities when standing on the final tenth level are from “want to acquire the buddha qualities of the past, future, and present lord buddhas” up to the establishing of beings in their respective results of stream enterer and so on.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པར་འདོད་པས་ཞེས་བྱ་བ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཉིད་ལས་ལྡོག་པ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ཞེས་བྱའོ་ཞེས་ཟེར་རོ།
en: Among these is “want to enter into the secure state of a bodhisattva”— turning away from the state of a śrāvaka or pratyekabuddha is called “the secure state of a bodhisattva.”

source: །གཞན་དག་ན་རེ་སྐྱོན་མེད་པ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་ལ་བྱའོ་ཞེས་སོ།
en: Others say to take “flawlessness” as the tathāgata­garbha.

source: །དེ་ལ་ཡང་གནས་སྐབས་ནི་གསུམ་སྟེ། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་སྐྱོན་མེད་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དོ།
en: In regard to that there are three periods: flawlessness that is the absence of defilement, the secure state of a bodhisattva, and the certification of dharmas.

source: །དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་དེ་ལ་ཡང་གནས་སྐབས་གསུམ་སྟེ། བྱིས་པ་སོ་སོ་སྐྱེ་བོའི་ས་ལ་མ་དག་པའི་གནས་སྐབས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་དག་པ་དང་མ་དག་པའི་གནས་སྐབས་དང་། དེ་བཞིན་གཤེགས་པའི་ས་ལ་དག་པའི་གནས་སྐབས་རྣམས་སོ།
en: As for the tathāgata­garbha, there are also three periods for that tathatā (“suchness”): the impure period in ordinary foolish beings, the period on the pure and impure bodhisattva levels, and the pure period on the Tathāgata level.

source: །དེ་ལ་མ་དག་པའི་དེ་བཞིན་ཉིད་ལ་ནི་སེམས་ཅན་ཞེས་བྱ་སྟེ།
en: There, the impure suchness is called “a being” (sattva).

source: དེ་ཡང་ཀུན་ནས་ཉོན་མོངས་པའི་སྐྱོན་མེད་པ་ཉིད་ཅེས་བྱའོ།
en: It is also called “the fixed state of defilement.”

source: །དག་པ་དང་མ་དག་པའི་གནས་སྐབས་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་སྟེ། བྱང་ཆུབ་ཀྱི་གནས་སྐབས་དག་པ་དང་། སེམས་ཅན་གྱི་གནས་སྐབས་མ་དག་པའི་ཕྱིར་རོ།
en: In the pure and impure period it is called “awakening and being” (bodhisattva) because the awakening (bodhi) period is pure, and the being (sattva) period impure.

source: །དེ་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ཉིད་ཅེས་བྱའོ།
en: Just that is called “the secure state of a bodhisattva.”

source: །དག་པའི་གནས་སྐབས་ལ་ནི་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་སྟེ། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་ནི་ཡང་དག་པ་དེ་བཞིན་ཉིད་ཀྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}སོ་ཞེས་འབྱུང་བའི་ཕྱིར་རོ།
en: In the pure period it is called the tathāgata because it said, “Tathāgata, Subhūti, is a word for perfect suchness.”

source: །དེ་ཉིད་ལ་ཆོས་སྐྱོན་མེད་པ་ཉིད་ཅེས་བྱའོ།
en: Just that is called “the certification of dharmas.”

source: །དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་སེམས་ཅན་ཞེས་བྱ་བ་མ་དག་པ་ཀུན་ནས་ཉོན་མོངས་པའི་སྐྱོན་མེད་པའི་གནས་སྐབས་གང་ཡིན་པ་དེ་ཡོངས་སུ་སྤངས་ནས། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དག་པ་དང་མ་དག་པ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ཉིད་ཀྱི་གནས་སྐབས་ཐོབ་པ་ལ། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ཞེས་བྱ་སྟེ།
en: The period when a bodhisattva has forsaken the impure, fixed state of defilement period (when the tathāgata­garbha is called “being”), and reached the pure and impure “secure state of a bodhisattva” period (when it is called “awakening and being”), is “the secure state of a bodhisattva.”

source: བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དེ་བཞིན་ཉིད་སྐྱོན་མེད་པའི་གནས་སྐབས་ཐོབ་པར་འདོད་པས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Hence it means they “want” to reach the period of “the secure state of” reality called bodhisattva (“awakening and being”). “

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདའ་བར་འདོད་པས་ཞེས་བྱ་བ་ནི་ཡོན་ཏན་ཁྱད་ཞུགས་པའི་ཕྱིར་ཏེ། སའི་ཡེ་ཤེས་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཡོན་ཏན་རྣམ་པ་བཞིས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ལས་འདས་པ་ཡིན་ཏེ། དབང་པོའི་ཁྱད་པར་དང་། སྒྲུབ་པའི་ཁྱད་པར་དང་། ཡེ་ཤེས་ཀྱི་ཁྱད་པར་དང་། འབྲས་བུའི་ཁྱད་པར་གྱིས་སོ།
en: Who want to pass beyond the level of śrāvakas and pratyekabuddhas”— this is because the qualities are superior, because a bodhisattva who has set out for the knowledge on the bodhisattva levels passes beyond the śrāvaka and pratyekabuddha levels on account of four qualities: special faculties, special accomplishment, special knowledge, and special result.

source: །དེ་ལ་ཉན་ཐོས་ནི་རང་བཞིན་གྱིས་དབང་པོ་རྟུལ་པོ་ཡིན། རང་སངས་རྒྱས་ནི་དབང་པོ་བར་མ་ཡིན། བྱང་ཆུབ་སེམས་དཔའ་ནི་དབང་པོ་རྣོན་པོ་ཡིན་ནོ།
en: There a śrāvaka has naturally dull faculties, a pratyekabuddha middling faculties, and a bodhisattva sharp faculties.

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ནི་རང་བཞིན་གྱིས་བདག་གི་དོན་ལྷུར་ལེན་པ་བདག་གི་དོན་ཉིད་སྒྲུབ་ཅིང་བདག་ལ་ཕན་པ་འབའ་ཞིག་མཐར་ཕྱིན་པར་བྱེད་དོ།
en: Śrāvakas and pratyekabuddhas naturally seek their own welfare, accomplish their own welfare, and complete benefits only for themselves.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བདག་དང་གཞན་གྱི་དོན་གཉི་ག་ལྷུར་ལེན་ལ། བདག་དང་གཞན་གྱི་དོན་ཉིད་བསྒྲུབས་ནས། བདག་དང་གཞན་ལ་ཕན་པ་ཉིད་མཐར་ཕྱིན་པར་མཛད་དོ།
en: Bodhisattvas naturally seek their own and others’ welfare, accomplish their own and others’ welfare, and complete benefits for themselves and others.

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ནི་ཆོས་རྣམས་ལ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པ་ཉིད་དུ་རྟོགས་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བདག་དང་གཞན་ལ་ཕན་པར་མཛད་པ་ལ་ཞུགས་པའི་ཕྱིར་རིག་པའི་གནས་ཐམས་ཅད་ལ་མཁས་པ་དང་།
en: Śrāvakas and pratyekabuddhas realize that dharmas are impermanent, suffering, empty, and selfless, while bodhisattvas who have set out to benefit themselves and others are skilled in all fields of knowledge, and, having established the many dispositions, aims, and mental states of beings, make them realize that all dharmas are characterized by being unfindable.

source: སེམས་ཅན་གྱི་ཁམས་དོན་རྣམ་པ་དུ་མ་བསྒྲུབས་ནས་དེའི་འོག་ཏུ་ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པའི་མཚན་ཉིད་དུ་རྟོགས་པར་མཛད་དོ། །ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ནི་ཉོན་མོངས་པའི་སྒྲིབ་པ་རྣམ་པར་དག་པ་ཉིད་ཐོབ་ནས་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པ་ཐོབ་པར་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་ཤེས་བྱའི་སྒྲིབ་པ་གཉིས་ཀ་སྤངས་ནས་མི་གནས་པའི་མྱ་ངན་ལས་འདས་པ་བསྒྲུབས་ཏེ། འཁོར་བའི་མཐའི་བར་དུ་སེམས་ཅན་ལ་ཕན་པའི་དོན་ཉིད་མཛད་དོ།
en: Śrāvakas and pratyekabuddhas gain the purification of afflicted obscurations and reach a nirvāṇa with no remaining aggregates, while bodhisattvas eliminate both afflicted obscurations and knowledge obscurations and establish themselves in a nonabiding nirvāṇa, looking after the welfare of beings until the end of saṃsāra. “

source: །ཕྱིར་མི་ལྡོག་པའི་ས་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དག་ཕྱིས་བྱང་ཆུབ་ཀྱི་སེམས་ལས་ལྡོག་པ་ནི་རྒྱུ་རྣམ་པ་བཞིས་འགྱུར་ཏེ། རིགས་དང་མི་ལྡན་པའམ། སྡིག་པའི་གྲོགས་པོས་ཡོངས་སུ་ཟིན་པའམ། སྙིང་རྗེ་ཆུང་བ་འམ། འཁོར་བའི་སྡུག་བསྔལ་ཤིན་ཏུ་ཡུན་རིང་ཞིང་མི་བཟད་པས་འཇིགས་པའི་ཕྱིར་ཏེ།
en: Who want to stand on the irreversible level”— there are four reasons why those who have produced the thought of awakening later turn back from the thought of awakening: because they are no longer in the lineage, or have gotten into the clutches of bad friends, or have weak compassion, or are scared of the extremely long and unbearable sufferings of saṃsāra.

source: རྒྱུ་དེ་བཞི་ཆར་ཡང་སར་ཆུད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་མེད་དོ།
en: All four of those causes, furthermore, are absent from bodhisattvas who have entered onto the bodhisattva levels.

source: །དེ་བས་ན་ས་རབ་ཏུ་དགའ་བ་ལ་སོགས་པ་ལ་ཕྱིར་མི་ལྡོག་པའི་ས་ཞེས་བྱའོ།
en: Therefore, the levels of Pramuditā and so on are called the irreversible levels. “

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ལ་སྦྱིན་པ་བྱིན་པ་ན་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་གཅིག་གིས་ཟིལ་གྱིས་གནོན་པར་འདོད་པས་ཞེས་བྱ་བ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་དག་གི་སྦྱིན་པ་བྱེད་པའི་སེམས་ནི་སྲེད་པ་དང་བཅས་ཤིང་རྣམ་པར་རྟོག་པ་དང་བཅས་པའི་ཕྱིར་སྲིད་པའི་འབྲས་བུ་འམ། བདག་གི་དོན་དུ་བྱེད་པར་འགྱུར་བས་དག་པ་མ་ཡིན་ནོ།
en: Who want to surpass gift-giving to all śrāvakas and pratyekabuddhas by producing a single thought with associated rejoicing”— the thought of śrāvakas and pratyekabuddhas when engaged in charity is not pure because it has craving, has conceptualization, and results in existence or in functioning for one’s own welfare.

source: །བྱང་ཆུབ་སེམས་དཔའི་རྗེས་སུ་ཡི་རང་བའི་སེམས་ནི་སྲིད་པ་མེད་པ་དང་། རྣམ་པར་མི་རྟོག་པ་དང་། མཚན་མའི་སྤྱོད་ཡུལ་མ་ཡིན་པ་དང་། བདག་དང་གཞན་ལ་ཕན་པ་སྒྲུབ་པ་སྟེ། ཡོན་ཏན་དེ་དག་གིས་འཕགས་པའི་ཕྱིར་ཟིལ་གྱིས་གནོན་ཏོ།
en: The bodhisattvas’ rejoicing thought is without craving, without conceptualization, does not have causal signs within its range, and is of benefit to self and others, so it is superior because of those qualities and hence is surpassing.

source: །དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་སོགས་པ་ལ་ཡང་སྦྱར་རོ།
en: Construe “the aggregate of morality” and so on in the same way as well.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་སྦྱིན་པ་ཆུང་ངུ་བྱིན་ཡང་ཞེས་བྱ་བ་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་ཞེས་བྱ་བ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕྱིར་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །སྦྱིན་པ་ཆུང་ངུ་ཞེས་བྱ་བ་ནི་ཡོ་བྱད་དང་མི་ལྡན་པའི་ཕྱིར་རོ།
en: In “for the sake of all beings… giving even a little gift,” “for the sake of all beings” says that it is for all beings; “a little gift” is because of not having many things.

source: །སེམས་ཅན་གྱི་དོན་དུ་ཡོངས་སུ་བསྔོས་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པ་དང་། འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་ཕྱིར་ཚད་མེད་གྲངས་མེད་པར་འགྱུར་རོ།
en: It becomes immeasurable and incalculable because of turning it over for the sake of all beings, because of turning it over to all-knowledge, and because of the purity of the three spheres. “
